tcfshcrw/playground/ESP32/src/Main.cpp

/* Todo*/
// https://github.com/espressif/arduino-esp32/issues/7779


#include "esp_timer.h" // Include the header for the high-resolution timer
#include "esp_partition.h"


#define ESTIMATE_LOADCELL_VARIANCE
//#define PRINT_SERVO_STATES

#define DEBUG_INFO_0_CYCLE_TIMER 1
#define DEBUG_INFO_0_NET_RUNTIME 2
// #define DEBUG_INFO_0_LOADCELL_READING 4
#define DEBUG_INFO_0_SERVO_READINGS 8
#define DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS 16
#define DEBUG_INFO_0_RESET_SERVO_TO_FACTORY 32
#define DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT 64
#define DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS 128


#define EFFECT_SCALING_FACTOR_FL32 4.0f;
#define EFFECT_POSITION_SCALING_FACTOR_FL32 0.1f;

#define BAUD3M 3000000
#define DEFAULTBAUD 921600
#include "Arduino.h"
#include "Main.h"
#ifdef CONFIG_IDF_TARGET_ESP32S3
  #include "soc/soc.h"
  #include "soc/rtc_cntl_reg.h"
#endif
Stream *ActiveSerial = nullptr;

#include "Version_Board.h"
#include "PedalInfoBuilder.h"
#ifdef Using_analog_output_ESP32_S3
#include <Wire.h>
#include <Adafruit_MCP4725.h>
  TwoWire MCP4725_I2C= TwoWire(1);
  //MCP4725 MCP(0x60, &MCP4725_I2C);
  Adafruit_MCP4725 dac;
  int current_use_mcp_index;
  bool MCP_status =false;
#endif


#include "FastTrig.h"



//#define ALLOW_SYSTEM_IDENTIFICATION



/**********************************************************************************************/
/*                                                                                            */
/*                         function declarations                                              */
/*                                                                                            */
/**********************************************************************************************/
void updatePedalCalcParameters();
void pedalUpdateTask( void * pvParameters );
void loadcellReadingTask( void * pvParameters );
void profilerTask( void * pvParameters );
void serialCommunicationTaskRx( void * pvParameters );
void serialCommunicationTaskTx( void * pvParameters );
void otaUpdateTask( void * pvParameters );
void espNowCommunicationTaskTx( void * pvParameters);
void miscTask( void * pvParameters);
void configUpdateTask( void * pvParameters );

#ifdef USB_JOYSTICK
  void joystickOutputTask( void * pvParameters );
#endif


#define INCLUDE_vTaskDelete 1
// https://www.tutorialspoint.com/cyclic-redundancy-check-crc-in-arduino
inline uint16_t checksumCalculator(uint8_t * data, uint16_t length)
{
   uint16_t curr_crc = 0x0000;
   uint8_t sum1 = (uint8_t) curr_crc;
   uint8_t sum2 = (uint8_t) (curr_crc >> 8);
   int index;
   for(index = 0; index < length; index = index + 1)
   {
      sum1 = (sum1 + data[index]) % 255;
      sum2 = (sum2 + sum1) % 255;
   }
   return (sum2 << 8) | sum1;
}




bool systemIdentificationMode_b = false;
unsigned long saveToEEPRomDuration=0;



bool splineDebug_b = false;



#include <EEPROM.h>
#define EEPROM_offset 15


#include "ABSOscillation.h"
#include "Rudder.h"
ABSOscillation absOscillation;
RPMOscillation _RPMOscillation;
BitePointOscillation _BitePointOscillation;
G_force_effect _G_force_effect;
WSOscillation _WSOscillation;
Road_impact_effect _Road_impact_effect;
Custom_vibration CV1;
Custom_vibration CV2;
Rudder _rudder;
helicoptersRudder helicopterRudder_;
Rudder_G_Force _rudder_g_force;
MovingAverageFilter averagefilter_joystick(40);



#include "DiyActivePedal_types.h"

DAP_config_class global_dap_config_class;
DRAM_ATTR DAP_calculationVariables_st dap_calculationVariables_st;
DAP_state_basic_st dap_state_basic_st;
DAP_state_extended_st dap_state_extended_st;
DAP_ESPPairing_st dap_esppairing_st;//saving
DAP_ESPPairing_st dap_esppairing_lcl;//sending
DAP_action_ota_st dap_action_ota_st;//OTA command(do not check version)



/**********************************************************************************************/
/*                                                                                            */
/*                         iterpolation  definitions                                          */
/*                                                                                            */
/**********************************************************************************************/

#include "ForceCurve.h"
ForceCurve_Interpolated forceCurve;



/**********************************************************************************************/
/*                                                                                            */
/*                         multitasking  definitions                                          */
/*                                                                                            */
/**********************************************************************************************/
#ifndef CONFIG_IDF_TARGET_ESP32S3
  #include "rtc_wdt.h"
#endif





static SemaphoreHandle_t semaphore_updatePedalStates=NULL;



/**********************************************************************************************/
/*                                                                                            */
/*                         queue declarations                                                 */
/*                                                                                            */
/**********************************************************************************************/
// ADD THIS: The handle for our new FreeRTOS queue
static QueueHandle_t pedalStateQueue = NULL;
static QueueHandle_t joystickDataQueue = NULL;
static QueueHandle_t loadcellDataQueue = NULL;
static QueueHandle_t configUpdateAvailableQueue = NULL;
static QueueHandle_t configUpdateSendToPedalUpdateTaskQueue = NULL;
static QueueHandle_t configUpdateSendToLoadcellTaskQueue = NULL;
// static QueueHandle_t configUpdateSendToJoystickTaskQueue = NULL;
static QueueHandle_t configUpdateSendToSerialRXTaskQueue = NULL;



// ADD THIS: New data structure to send both states together in one package
typedef struct {
    DAP_state_basic_st    basic_st;
    DAP_state_extended_st extended_st;
    bool sendBasicFlag_b;
    bool sendExtendedFlag_b;
} PedalStatePackage_t;

