tcfshcrw/playground/ESP32/src/Main.cpp
    // Persistent buffer to accumulate fragmented data
    static uint8_t temp_buffer[TEMP_BUFFER_SIZE];
    static size_t temp_buffer_len = 0;

    for (;;) {
        // Wait for a UART event
        if (xQueueReceive(uart_queue, (void *)&event, (TickType_t)portMAX_DELAY)) {
            
            ActiveSerial->println("UART event triggered");

            switch (event.type) {
                case UART_PATTERN_DET: {

                    ActiveSerial->println("EOF1 detected");

                    // // Read all available new data from the hardware buffer
                    // uint8_t incoming_data[UART_RX_BUF_SIZE];
                    // size_t buffered_size;
                    // uart_get_buffered_data_len(UART_NUM_0, &buffered_size);
                    // int read_len = uart_read_bytes(UART_NUM_0, incoming_data, buffered_size, pdMS_TO_TICKS(100));

                    // if (read_len > 0) {
                    //     // --- 1. Append new data, checking for overflow ---
                    //     if (temp_buffer_len + read_len > TEMP_BUFFER_SIZE) {
                    //         ActiveSerial->println("ERROR: UART temporary buffer overflow. Discarding all data.");
                    //         temp_buffer_len = 0; // Reset the buffer
                    //         break; 
                    //     }
                    //     memcpy(&temp_buffer[temp_buffer_len], incoming_data, read_len);
                    //     temp_buffer_len += read_len;

                    //     // --- 2. Scan buffer for complete packets and process them ---
                    //     if (temp_buffer[temp_buffer_len-2] == EOF_BYTE_0 && temp_buffer[temp_buffer_len-1] == EOF_BYTE_1) {
                            

                    //         // --- 3. Extract the packet and send it to the queue ---
                    //         UartPacket_t packet_to_send;
                    //         packet_to_send.len = temp_buffer_len;
                    //         memcpy(packet_to_send.data, temp_buffer, temp_buffer_len);
                    //         xQueueSend(serial_packet_queue, &packet_to_send, (TickType_t)0);

                    //         // --- 4. Remove the processed packet by shifting the buffer ---
                    //         size_t remaining_len = 0;//temp_buffer_len - packet_len;
                    //         temp_buffer_len = remaining_len;
                    //     }
                    //   }
                    }
                    break;
                

                // --- Error handling cases remain the same ---
                case UART_FIFO_OVF:
                    ActiveSerial->println("Hardware FIFO overflow");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;

                case UART_BUFFER_FULL:
                    ActiveSerial->println("Ring buffer full");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;
                
                default:
                    uart_flush_input(UART_NUM_0);
                    break;
            }
        }
    }
    vTaskDelete(NULL);
}

#endif




void setup()
{
  DAP_config_st dap_config_st_local;
  DAP_config_st dap_config_st_eeprom;

  // setup serial
  // #define USE_CDC_INSTEAD_OF_UART
  #ifdef USE_CDC_INSTEAD_OF_UART
    Serial.begin(DEFAULTBAUD);
    //Serial.enableReboot(false);
    
    Serial.setTxTimeoutMs(100);
    ActiveSerial = &Serial;
    #ifdef USB_JOYSTICK
      ActiveSerial->println("Setup Controller");
      SetupController();
    #endif
  #elif CONFIG_IDF_TARGET_ESP32S3
    Serial1.begin(BAUD3M, SERIAL_8N1, 44, 43);
    // Serial.begin(BAUD3M, SERIAL_8N1, 44, 43);
    ActiveSerial = &Serial1;
  #elif CONFIG_IDF_TARGET_ESP32
    Serial.begin(DEFAULTBAUD);
    // Serial.begin(BAUD3M, SERIAL_8N1, 44, 43);
    ActiveSerial = &Serial;
  #endif





  // ADD THIS: Create the queue before creating the tasks that use it.
  // The queue can hold up to N state packages.
  pedalStateQueue = xQueueCreate(10, sizeof(PedalStatePackage_t));
  if (pedalStateQueue == NULL) {
      ActiveSerial->println("Error creating the pedal state queue!");
  }
  joystickDataQueue = xQueueCreate(1, sizeof(joystickDataPackage_t));
  if (joystickDataQueue == NULL) {
      ActiveSerial->println("Error creating the joystick data queue!");
  }
  loadcellDataQueue = xQueueCreate(1, sizeof(loadcellDataPackage_t));
  if (loadcellDataQueue == NULL) {
      ActiveSerial->println("Error creating the joystick data queue!");
  }
  configUpdateAvailableQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  if (configUpdateAvailableQueue == NULL) {
      ActiveSerial->println("Error creating the config data queue!");
  }
  configUpdateSendToPedalUpdateTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  if (configUpdateSendToPedalUpdateTaskQueue == NULL) {
      ActiveSerial->println("Error creating the config data queue!");
  }
  configUpdateSendToLoadcellTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  if (configUpdateSendToLoadcellTaskQueue == NULL) {
      ActiveSerial->println("Error creating the config data queue!");
  }
  // configUpdateSendToJoystickTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  // if (configUpdateSendToJoystickTaskQueue == NULL) {
  //     ActiveSerial->println("Error creating the config data queue!");
  // }
  configUpdateSendToSerialRXTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  if (configUpdateSendToSerialRXTaskQueue == NULL) {
      ActiveSerial->println("Error creating the config data queue!");
  }



  xTaskCreatePinnedToCore(
                    configHandlingTask,   /* Task function. */
                    "configHandlingTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_CONFIG_HANDLING_TASK,           /* priority of the task */
                    &handle_configHandlingTask,      /* Task handle to keep track of created task */
                    CORE_ID_CONFIG_HANDLING_TASK);          /* pin task to core 1 */  

  

  

  // setup brake resistor pin
  #ifdef BRAKE_RESISTOR_PIN
    pinMode(BRAKE_RESISTOR_PIN, OUTPUT);  // Set GPIO13 as an output
    digitalWrite(BRAKE_RESISTOR_PIN, LOW);  // Turn the LED on
  #endif

  #ifdef EMERGENCY_PIN
    pinMode(EMERGENCY_PIN,INPUT_PULLUP);
  #endif

  #ifdef ANGLE_SENSOR_GPIO

    pinMode(ANGLE_SENSOR_GPIO, INPUT);
    pinMode(ANGLE_SENSOR_GPIO_2, INPUT);
  #endif
  

