tcfshcrw/playground/ESP32/src/Main.cpp
  #ifdef USING_LED
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show(); 
  #endif

  Buzzer.initialized(BuzzerPin, 1);
  Buzzer.single_beep_tone(770, 100);


  parse_version(DAP_FIRMWARE_VERSION, &versionMajor, &versionMinor, &versionPatch);
  ActiveSerial->println(" ");
  ActiveSerial->println(" ");
  ActiveSerial->println(" ");
  //delay(3000);
  ActiveSerial->println("This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
  ActiveSerial->println("Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");
  //printout the github releasing version
  //#ifdef OTA_update
  ActiveSerial->print("Board: ");
  ActiveSerial->println(CONTROL_BOARD);
  ActiveSerial->print("Firmware Version:");
  ActiveSerial->println(DAP_FIRMWARE_VERSION);
  //#endif
  #ifdef PRINT_PARTITION_TABLE
    ActiveSerial->printf("========== Partition Table ==========\n");
    ActiveSerial->printf("| %-10s | %-4s | %-7s | %-8s | %-8s | %-5s |\n", "Name", "Type", "SubType", "Offset", "Size", "Encrypted");
    ActiveSerial->printf("--------------------------------------------------------------------------------\n");
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
    while (it != NULL) {
        const esp_partition_t *part = esp_partition_get(it);
        ActiveSerial->printf("| %-10s | 0x%02x | 0x%02x    | 0x%08x | 0x%08x | %-5s |\n",
               part->label,      
               part->type,       
               part->subtype,    
               part->address,    
               part->size,       
               part->encrypted ? "true" : "false");
        it = esp_partition_next(it);
    }
    esp_partition_iterator_release(it);
    ActiveSerial->printf("=====================================\n");
  #endif
  
	#ifdef Hardware_Pairing_button
    pinMode(Pairing_GPIO, INPUT_PULLUP);
  #endif

  #ifdef USING_LED
    pixels.setPixelColor(0,0xff,0x00,0x00);
    pixels.show(); 
  #endif


  // Load config from EEPROM, if valid, overwrite initial config
  EEPROM.begin(2048);
  global_dap_config_class.loadConfigFromEprom();
  global_dap_config_class.getConfig(&dap_config_st_eeprom, 500);


  // check validity of data from EEPROM  
  bool structChecker = true;
  uint16_t crc;
  if ( dap_config_st_eeprom.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_CONFIG ){ 
    structChecker = false;
    /*ActiveSerial->print("Payload type expected: ");
    ActiveSerial->print(DAP_PAYLOAD_TYPE_CONFIG);
    ActiveSerial->print(",   Payload type received: ");
    ActiveSerial->println(dap_config_st_local.payLoadHeader_.payloadType);*/
  }
  if ( dap_config_st_eeprom.payLoadHeader_.version != DAP_VERSION_CONFIG ){ 
    structChecker = false;
    /*ActiveSerial->print("Config version expected: ");
    ActiveSerial->print(DAP_VERSION_CONFIG);
    ActiveSerial->print(",   Config version received: ");
    ActiveSerial->println(dap_config_st_local.payLoadHeader_.version);*/
  }
  // checksum validation
  crc = checksumCalculator((uint8_t*)(&(dap_config_st_eeprom.payLoadHeader_)), sizeof(dap_config_st_eeprom.payLoadHeader_) + sizeof(dap_config_st_eeprom.payLoadPedalConfig_));
  if (crc != dap_config_st_eeprom.payloadFooter_.checkSum){ 
    structChecker = false;
    /*ActiveSerial->print("CRC expected: ");
    ActiveSerial->print(crc);
    ActiveSerial->print(",   CRC received: ");
    ActiveSerial->println(dap_config_st_local.payloadFooter_.checkSum);*/
  }






  // if checks are successfull, overwrite global configuration struct
  if (structChecker == true)
  {
    ActiveSerial->println("Updating pedal config from EEPROM");
    //global_dap_config_class.setConfig(dap_config_st_local);
    dap_config_st_local = dap_config_st_eeprom;
    configDataPackage_t configPackage_st;
    configPackage_st.config_st = dap_config_st_local;
    // xQueueSend(configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);

  }
  else
  {

    ActiveSerial->println("Couldn't load config from EPROM due to mismatch: ");

    ActiveSerial->print("Payload type expected: ");
    ActiveSerial->print(DAP_PAYLOAD_TYPE_CONFIG);
    ActiveSerial->print(",   Payload type received: ");
    ActiveSerial->println(dap_config_st_local.payLoadHeader_.payloadType);

    ActiveSerial->print("Target version: ");
    ActiveSerial->print(DAP_VERSION_CONFIG);
    ActiveSerial->print(",    Source version: ");
    ActiveSerial->println(dap_config_st_local.payLoadHeader_.version);

    ActiveSerial->print("CRC expected: ");
    ActiveSerial->print(crc);
    ActiveSerial->print(",   CRC received: ");
    ActiveSerial->println(dap_config_st_local.payloadFooter_.checkSum);
    //if the config check all failed, reinitialzie _config_st
    ActiveSerial->println("initialized config");
    global_dap_config_class.initializedConfig();
    global_dap_config_class.getConfig(&dap_config_st_local, 500);
  }

  ActiveSerial->println("Config sent successfully");
  // interprete config values
  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);

  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x5f,0x5f,0x00);//yellow
      pixels.show(); 
      //delay(3000);
  #endif

  bool invMotorDir = dap_config_st_local.payLoadPedalConfig_.invertMotorDirection_u8 > 0;
  stepper = new StepperWithLimits(stepPinStepper, dirPinStepper, invMotorDir, dap_calculationVariables_st.stepsPerMotorRevolution, dap_config_st_local.payLoadPedalConfig_.servoRatioOfInertia_u8); 

  motorRevolutionsPerSteps_fl32 = 1.0f / ( (float)dap_calculationVariables_st.stepsPerMotorRevolution );
  // ActiveSerial->printf("Steps per motor revolution: %d\n", dap_calculationVariables_st.stepsPerMotorRevolution);

  #ifdef USES_ADS1220
    /*  Uses ADS1220 */
    loadcell = new LoadCell_ADS1220();

  #else
    /*  Uses ADS1256 */
    loadcell = new LoadCell_ADS1256();
  #endif

  loadcell->setLoadcellRating(dap_config_st_local.payLoadPedalConfig_.loadcell_rating);
  loadcell->estimateBiasAndVariance();       // automatically identify sensor noise for KF parameterization

	// find the min & max endstops
	ActiveSerial->println("Start homing");
	stepper->findMinMaxSensorless(dap_config_st_local);
  ActiveSerial->print("Min Position is "); ActiveSerial->println(stepper->getLimitMin());
  ActiveSerial->print("Max Position is "); ActiveSerial->println(stepper->getLimitMax());


  // setup Kalman filters
  // ActiveSerial->print("Given loadcell variance: ");
  // ActiveSerial->println(loadcell->getVarianceEstimate(), 5);
  kalman = new KalmanFilter_1st_order(loadcell->getVarianceEstimate());
  kalman_joystick =new KalmanFilter_1st_order(0.1f);
  kalman_2nd_order = new KalmanFilter_2nd_order(loadcell->getVarianceEstimate());


  // LED signal 
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0, 0x80, 0x00, 0x80);//purple
      pixels.show(); 
      //delay(3000);
  #endif

  

  // equalize pedal config for both tasks
  global_dap_config_class.getConfig(&dap_config_st_local, 500);

  // send to config handling task
  xQueueSend(configUpdateAvailableQueue, &dap_config_st_local, portMAX_DELAY);


  // setup multi tasking
  semaphore_updatePedalStates = xSemaphoreCreateMutex();



  delay(10);

  // disableCore0WDT();
  // disableCore1WDT();

  ActiveSerial->println("Starting other tasks");

  // Register tasks
  addScheduledTask(pedalUpdateTask, "pedalUpdateTask", REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US, TASK_PRIORITY_PEDAL_UPDATE_TASK, CORE_ID_PEDAL_UPDATE_TASK, 7000);
  addScheduledTask(serialCommunicationTaskRx, "serComRx", REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US, TASK_PRIORITY_SERIALCOMMUNICATION_TASK, CORE_ID_SERIAL_COMMUNICATION_TASK, 6000);

  // === Replace hw_timer with esp_timer ===
  const esp_timer_create_args_t periodic_timer_args = {
    .callback = &onTimer,
    .arg = NULL,
    .name = "sched_timer"
  };

  esp_timer_handle_t periodic_timer;
  esp_timer_create(&periodic_timer_args, &periodic_timer);

  // Start periodic timer at BASE_TICK_US interval
  esp_timer_start_periodic(periodic_timer, BASE_TICK_US);


	// the serialCommunicationTaskTx does not need a dedicated timer, since it triggered by queue 
  xTaskCreatePinnedToCore(
      serialCommunicationTaskTx,      /* Task function. */
      "serComTx",    /* name of task. */
      2000,                           /* Stack size of task */
      NULL,                           /* parameter of the task */
      TASK_PRIORITY_SERIALCOMMUNICATION_TX_TASK,                              /* priority of the task (e.g., 2, slightly higher than producer) */
      &handle_serialCommunicationTx,  /* Task handle */
      CORE_ID_SERIAL_COMMUNICATION_TASK); /* pin task to core */

