tcfshcrw/playground/ESP32/src/Main.cpp
                }

                
                ActiveSerial->println("-----------------------\n");
            }
        }

        // Free the previous snapshot and save the current one for the next cycle
        if (pxPreviousTaskArray != NULL) {
            vPortFree(pxPreviousTaskArray);
        }
        pxPreviousTaskArray = pxCurrentTaskArray;
        ulPreviousTotalRunTime = ulCurrentTotalRunTime;
        uxPreviousArraySize = uxCurrentArraySize;
    } else {
        ActiveSerial->println("Failed to allocate memory for task stats.");
    }
}

void profilerTask( void * pvParameters )
{
  for(;;){
    // copy global struct to local for faster and safe executiion
    DAP_config_st dap_config_profilerTask_st;
    global_dap_config_class.getConfig(&dap_config_profilerTask_st, 500);

    // activate profiler depending on pedal config
    if (dap_config_profilerTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_NET_RUNTIME) 
    {
      printTaskStats();
    }


    delay(5000);
    taskYIELD();
  }
}


void loop() {
  // vTaskDelete(NULL);  // Kill the Arduino loop task

  delay(5000);
  taskYIELD();
}




/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update task                                                  */
/*                                                                                            */
/**********************************************************************************************/
//#define ESPNow_debug_rudder

#ifdef ESPNow_debug_rudder
  unsigned long debugMessageLast=0;
#endif 

void IRAM_ATTR_FLAG pedalUpdateTask( void * pvParameters )
{

  static DRAM_ATTR DAP_state_extended_st dap_state_extended_st_lcl_pedalUpdateTask;
  static DRAM_ATTR DAP_state_basic_st dap_state_basic_st_lcl_pedalUpdateTask;
  static DRAM_ATTR DAP_config_st dap_config_pedalUpdateTask_st;

  static loadcellDataPackage_t loadcellDataReceived_st;
  static configDataPackage_t configPackage_st;

  FunctionProfiler profiler_pedalUpdateTask;
  profiler_pedalUpdateTask.setName("PedalUpdate");

  static DRAM_ATTR float loadcellReading = 0.0f;
  float filteredReading_exp_filter = 0.0f;
  static DRAM_ATTR float filteredReading = 0.0f;

  unsigned long servoActionLast = millis();
  

  uint32_t controlTask_stackSizeIdx_u32 = 0;
  float previousLoadcellReadingInKg_fl32 = 0.0f;


  float effect_force_fl32;
  float effect_pos_fl32;
  int32_t Position_effect;
  int32_t BP_trigger_value;
  int32_t BP_trigger_min;
  int32_t BP_trigger_max;
  int32_t Position_check;
  int32_t Rudder_real_poisiton;
  float joystickNormalizedToInt32_orig;
  float joystickfrac;
  float joystickNormalizedToInt32_eval;
  uint16_t joystickNormalizedToUInt16 = 0;
  int32_t ABS_trigger_value;

  uint8_t sendPedalStructsViaSerialCounter_u8 = 0;
  uint8_t sendJoystickDataCounter_u8 = 0;

  
  global_dap_config_class.getConfig(&dap_config_pedalUpdateTask_st, 500);

  static const uint8_t joystickSendCounterMax_u8 = (REPETITION_INTERVAL_JOYSTICKOUTPUT_TASK_IN_US) / (REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US) ;
  static const uint8_t serialSendCounterMax_u8 = (REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US) / (REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US) ;

  
  

  
  static float changeVelocity = 0.0f;
  static float normalizedPedalReading_fl32 = 0.0f;
  static float stepperPosFraction_fl32 = 0.0f;
  static uint16_t angleReading_ui16 = 0;
  static bool sendBasicFlag_b = false;
  static bool sendExtendedFlag_b = false;
  static int32_t stepperPosCurrent_i32;
  static uint32_t cycleCount_u32 = 0;

  for(;;){


    // trigger task 
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

      // if new data package is available, update the local config
      if (xQueueReceive(configUpdateSendToPedalUpdateTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS) {
        dap_config_pedalUpdateTask_st = configPackage_st.config_st;

        // activate profiler depending on pedal config
        if (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_pedalUpdateTask.activate( true );
        }
        else
        {
          profiler_pedalUpdateTask.activate( false );
        }

        ActiveSerial->println("Update config: pedal update task");



        // update the calc params
        ActiveSerial->println("Updating the calc params");
        //ActiveSerial->print("save to eeprom tag:");
        //ActiveSerial->println(dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom);
        saveToEEPRomDuration = millis();
        
        if (true == dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom)
        {
          dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom = false; // set to false, thus at restart existing EEPROM config isn't restored to EEPROM
          uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_pedalUpdateTask_st.payLoadHeader_)), sizeof(dap_config_pedalUpdateTask_st.payLoadHeader_) + sizeof(dap_config_pedalUpdateTask_st.payLoadPedalConfig_));
          dap_config_pedalUpdateTask_st.payloadFooter_.checkSum = crc;
          global_dap_config_class.setConfig(dap_config_pedalUpdateTask_st);
          ActiveSerial->println("Saving into EEPROM");
          global_dap_config_class.storeConfigToEprom();
          
          saveToEEPRomDuration = 0;
        }
        
        updatePedalCalcParameters(); // update the calc parameters
        moveSlowlyToPosition_b = true;

        // enable/disable step loss recovery and crash
        stepper->configSteplossRecovAndCrashDetection(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.stepLossFunctionFlags_u8);

        // set position command smoothing
        stepper->configSetPositionCommandSmoothingFactor(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.positionSmoothingFactor_u8);
        stepper->configSetProfilingFlag( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) );
        stepper->configSetRatioOfInertia(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.servoRatioOfInertia_u8);

        // reset all servo alarms
        if ( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS) )
        {
          ActiveSerial->println("Set clear alarm history flag");
          stepper->clearAllServoAlarms();
          delay(1000); // makes sure the routine has finished

          DAP_config_st tmp;
          global_dap_config_class.getConfig(&tmp, 500);
          tmp.payLoadPedalConfig_.debug_flags_0 &= ( ~(uint8_t)DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS); // clear the debug bit
          //global_dap_config_class.setConfig(tmp);

