tcfshcrw/playground/ESP32/src/Main.cpp
          configDataPackage_t configPackage_st;
          configPackage_st.config_st = tmp;
          xQueueSend(configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);
        }

        // reset all servo alarms
        if ( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_RESET_SERVO_TO_FACTORY) )
        {
          DAP_config_st tmp;
          global_dap_config_class.getConfig(&tmp, 500);
          tmp.payLoadPedalConfig_.debug_flags_0 &= ( ~(uint8_t)DEBUG_INFO_0_RESET_SERVO_TO_FACTORY); // clear the debug bit
          tmp.payLoadHeader_.storeToEeprom = 1;
          //global_dap_config_class.setConfig(tmp);

          configDataPackage_t configPackage_st;
          configPackage_st.config_st = tmp;
          xQueueSend(configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);

          delay(500);

          global_dap_config_class.storeConfigToEprom();

          ActiveSerial->println("Resetting servo parameters to factory values");
          stepper->resetServoParametersToFactoryValues();
        }

        

        // print all servo parameters for debug purposes
        if ( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS) )
        {
          DAP_config_st tmp;
          global_dap_config_class.getConfig(&tmp, 500);
          tmp.payLoadPedalConfig_.debug_flags_0 &= ( ~(uint8_t)DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS); // clear the debug bit
          //global_dap_config_class.setConfig(tmp);

          configDataPackage_t configPackage_st;
          configPackage_st.config_st = tmp;
          xQueueSend(configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);

          delay(1000);  
          stepper->printAllServoParameters();
        }

        // ActiveSerial->printf("Abs ampl.: %0.3f\n", (float)dap_calculationVariables_st.absAmplitude);
        // ActiveSerial->printf("force range.: %0.3f\n", (float)dap_calculationVariables_st.Force_Range);
        // ActiveSerial->printf("pos range: %0.3f\n", (float)dap_calculationVariables_st.stepperPosRange);
        
        //bitepoint trigger
        BP_trigger_value = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.BP_trigger_value;
        BP_trigger_min = (BP_trigger_value-4);
        BP_trigger_max = (BP_trigger_value+4);

      }


      // start profiler 0, overall function
      profiler_pedalUpdateTask.start(0);
      


      cycleCount_u32++;

      // get current position
      stepperPosFraction_fl32 = stepper->getCurrentPositionFraction();
      stepperPosCurrent_i32 = stepper->getCurrentPosition();

      // system identification mode
      #ifdef ALLOW_SYSTEM_IDENTIFICATION
        if (systemIdentificationMode_b == true)
        {
          measureStepResponse(stepper, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, loadcell);
          systemIdentificationMode_b = false;
        }
      #endif
    

      
      //#define RECALIBRATE_POSITION
      #ifdef RECALIBRATE_POSITION
        stepper->checkLimitsAndResetIfNecessary();
      #endif



      // start profiler 1, effects
      profiler_pedalUpdateTask.start(1);

      // bitepoint helper
      Position_check = (int32_t)(stepperPosFraction_fl32 * 100.0f);

      // compute pedal oscillation, when ABS is active
      dap_calculationVariables_st.Default_pos();

      // trigger and compute effects
      absOscillation.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absPattern, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absForceOrTarvelBit);
      _RPMOscillation.trigger();
      _RPMOscillation.forceOffset(&dap_calculationVariables_st);
      _BitePointOscillation.forceOffset(&dap_calculationVariables_st);
      _G_force_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_multi);
      _WSOscillation.forceOffset(&dap_calculationVariables_st);
      _Road_impact_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_multi);
      CV1.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_1,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_1,dap_calculationVariables_st.stepperPosRange);
      CV2.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_2,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_2,dap_calculationVariables_st.stepperPosRange);
      
      if(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.BP_trigger==1)
      {
        if(Position_check > BP_trigger_min)
        {
          if(Position_check < BP_trigger_max)
          {
            _BitePointOscillation.trigger();
          }
        }
      }
      

      if(dap_calculationVariables_st.Rudder_status) 
      {
        _rudder_g_force.offset_calculate(&dap_calculationVariables_st);
        dap_calculationVariables_st.update_stepperMaxpos(_rudder_g_force.offset_filter);
        _rudder.offset_calculate(&dap_calculationVariables_st);
        dap_calculationVariables_st.update_stepperMinpos(_rudder.offset_filter);

      }
      if(dap_calculationVariables_st.helicopterRudderStatus) 
      {
        helicopterRudder_.offset_calculate(&dap_calculationVariables_st);
        dap_calculationVariables_st.update_stepperMinpos(helicopterRudder_.offset_filter);
      }
      #ifdef ESPNow_debug_rudder
      if(dap_calculationVariables_st.Rudder_status || dap_calculationVariables_st.helicopterRudderStatus)
      {
        if(millis()-debugMessageLast>500 )
        {
          debugMessageLast=millis();
          ActiveSerial->print("Center offset:");
          ActiveSerial->println(_rudder.offset_filter);
          ActiveSerial->print("pos min:");
          ActiveSerial->println(dap_calculationVariables_st.stepperPosMin);
          ActiveSerial->print("pos max:");
          ActiveSerial->println(dap_calculationVariables_st.stepperPosMax);
          ActiveSerial->print("max Force:");
          ActiveSerial->print("max Force:");
          ActiveSerial->print(dap_calculationVariables_st.Force_Max);
          ActiveSerial->print(" min Force:");
          ActiveSerial->println(dap_calculationVariables_st.Force_Min);
          ActiveSerial->print("Force:");
          ActiveSerial->println(filteredReading);
        }
      }
      #endif

      //_rudder.force_offset_calculate(&dap_calculationVariables_st);


      //update max force with G force effect
      movingAverageFilter.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_window;
      movingAverageFilter_roadimpact.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_window;
      dap_calculationVariables_st.reset_maxforce();
      dap_calculationVariables_st.Force_Max += _G_force_effect.G_force;
      dap_calculationVariables_st.Force_Max += _Road_impact_effect.Road_Impact_force;
      dap_calculationVariables_st.dynamic_update();
      dap_calculationVariables_st.updateStiffness();
    
      // end profiler 1, effects
      profiler_pedalUpdateTask.end(1);

