tcfshcrw/playground/ESP32/src/Main.cpp
      dap_calculationVariables_st.current_pedal_position = positionWithoutEffect;
      dap_calculationVariables_st.current_pedal_position_ratio=((float)(dap_calculationVariables_st.current_pedal_position-dap_calculationVariables_st.stepperPosMin_default))/((float)dap_calculationVariables_st.stepperPosRange_default);
      //Rudder initialzing and de initializing
      #ifdef ESPNOW_Enable
        if(dap_calculationVariables_st.Rudder_status)
        {
          if(Rudder_initializing)
          {
            moveSlowlyToPosition_b=true;
            //ActiveSerial->println("moving to center");
          }
          if(Rudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
          {
            if(Rudder_initialized_time==0)
            {
              Rudder_initialized_time=millis();
            }
            else
            {
              unsigned long Rudder_initialzing_time_Now = millis();
              //wait 3s for the initializing
              //ActiveSerial->print("Rudder initializing...");
              //ActiveSerial->println(Rudder_initialzing_time_Now-Rudder_initialized_time);
              if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
              {
                Rudder_initializing=false;
                moveSlowlyToPosition_b=false;
                ActiveSerial->println("Rudder initialized");
                dap_calculationVariables_st.isRudderInitialized=true;
                Rudder_initialized_time=0;
                Buzzer.play_melody_tone(melody_Airship_theme, sizeof(melody_Airship_theme)/sizeof(melody_Airship_theme[0]),melody_Airship_theme_duration);
              }
            }
            

          }
        }
        if(Rudder_deinitializing)
        {
          moveSlowlyToPosition_b=true;
          //ActiveSerial->println("moving to min end stop");
        }
        if(Rudder_deinitializing && (Rudder_real_poisiton< 2 ))
        {
          Rudder_deinitializing=false;
          moveSlowlyToPosition_b=false;
          ActiveSerial->println("Rudder deinitialized");
          dap_calculationVariables_st.isRudderInitialized=false;
        }
        //helicopter rudder initialzied
        if(dap_calculationVariables_st.helicopterRudderStatus)
        {
          if(HeliRudder_initializing)
          {
            moveSlowlyToPosition_b=true;
            //ActiveSerial->println("moving to center");
          }
          if(HeliRudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
          {
            if(Rudder_initialized_time==0)
            {
              Rudder_initialized_time=millis();
            }
            else
            {
              unsigned long Rudder_initialzing_time_Now = millis();
              //wait 3s for the initializing
              //ActiveSerial->print("Rudder initializing...");
              //ActiveSerial->println(Rudder_initialzing_time_Now-Rudder_initialized_time);
              if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
              {
                HeliRudder_initializing=false;
                moveSlowlyToPosition_b=false;
                ActiveSerial->println("HeliRudder initialized");
                dap_calculationVariables_st.isHelicopterRudderInitialized=true;
                Rudder_initialized_time=0;
                Buzzer.play_melody_tone(melodyAirwolfTheme, sizeof(melodyAirwolfTheme)/sizeof(melodyAirwolfTheme[0]),melodyAirwolfThemeDuration);
              }
            }
          }
        }
        if(HeliRudder_deinitializing)
        {
          moveSlowlyToPosition_b=true;
            //ActiveSerial->println("moving to min end stop");
        }
        if(HeliRudder_deinitializing && (Rudder_real_poisiton< 2 ))
        {
          HeliRudder_deinitializing=false;
          moveSlowlyToPosition_b=false;
          ActiveSerial->println("HeliRudder deinitialized");
          dap_calculationVariables_st.isHelicopterRudderInitialized=false;
        }
      #endif

      

      // if pedal in min position, recalibrate position --> automatic step loss compensation
      // stepper->configSteplossRecovAndCrashDetection(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.stepLossFunctionFlags_u8);
      if( (stepper->getLifelineSignal()==true) && (stepper->servoStatus==SERVO_CONNECTED) )
      {
        if (stepper->isAtMinPos())
        {
          #if defined(OTA_update_ESP32) || defined(OTA_update)
            if(OTA_status==false)
            {
              stepper->correctPos();
            }
          #else
            stepper->correctPos();
          #endif
        }
      }
      

      


      // stop movement, when OTA is in progres
      bool doMovement_b = true;
      #if defined(OTA_update_ESP32) || defined(OTA_update)
        if(OTA_status==true)
        {
          doMovement_b = false;
        } 
      #endif

      // Move to new position
      if (doMovement_b)
      {
        if (!moveSlowlyToPosition_b)
        {
          stepper->moveTo(Position_Next, false);
        }
        else
        {
          moveSlowlyToPosition_b = false;
          stepper->moveSlowlyToPos(Position_Next);
        }
      }
    
      // compute controller output
      dap_calculationVariables_st.StepperPos_setback();
      dap_calculationVariables_st.reset_maxforce();
      dap_calculationVariables_st.dynamic_update();
      dap_calculationVariables_st.updateStiffness();
      

      // compute joystick value
      if(dap_calculationVariables_st.Rudder_status&&dap_calculationVariables_st.rudder_brake_status)
      {
        if (1 == dap_config_pedalUpdateTask_st.payLoadPedalConfig_.travelAsJoystickOutput_u8)
        {
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue((stepperPosCurrent_i32-dap_calculationVariables_st.stepperPosRange/2), dap_calculationVariables_st.stepperPosMin, dap_calculationVariables_st.stepperPosMin+dap_calculationVariables_st.stepperPosRange/2.0f, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
        }
        else
        {
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue((FilterReadingJoystick/*filteredReading*/), dap_calculationVariables_st.Force_Min, dap_calculationVariables_st.Force_Max, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
        }
      }
      else
      {
        if (1 == dap_config_pedalUpdateTask_st.payLoadPedalConfig_.travelAsJoystickOutput_u8)
        {
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue(stepperPosCurrent_i32, dap_calculationVariables_st.stepperPosMin, dap_calculationVariables_st.stepperPosMax, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
        }
        else
        {            
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue(FilterReadingJoystick/*filteredReading*/, dap_calculationVariables_st.Force_Min, dap_calculationVariables_st.Force_Max, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
        }
      }
      joystickfrac=(float)joystickNormalizedToInt32_orig/(float)JOYSTICK_MAX_VALUE;
      joystickNormalizedToInt32_eval = forceCurve.EvalJoystickCubicSpline(&dap_config_pedalUpdateTask_st, &dap_calculationVariables_st, joystickfrac);
      
      joystickNormalizedToUInt16 = joystickNormalizedToInt32_eval/100.0f* JOYSTICK_MAX_VALUE;
      joystickNormalizedToUInt16 = constrain(joystickNormalizedToUInt16, JOYSTICK_MIN_VALUE, JOYSTICK_MAX_VALUE);      


      // send joystick data to queue
      if (joystickDataQueue != NULL) {

        // send data every N-th frame
        sendJoystickDataCounter_u8++;
        sendJoystickDataCounter_u8 %= joystickSendCounterMax_u8;

        if (sendJoystickDataCounter_u8 == 0)
        {
          // Package the new state data into a single struct
          joystickDataPackage_t newJoystickPackage;
          newJoystickPackage.sendJoystickFlag_b = true;
          newJoystickPackage.joystickNormalizedToUInt16 = joystickNormalizedToUInt16;

          // Send the package to the queue. Use a timeout of 0 (non-blocking).
          // If the queue is full, the data is simply dropped. This prevents this
          // high-priority control task from ever blocking on a full serial buffer.
          xQueueSend(joystickDataQueue, &newJoystickPackage, (TickType_t)0);
        }
      }


      

      // provide joystick output on PIN
      #ifdef Using_analog_output
        int dac_value=(int)(joystickNormalizedToInt32*255/10000);
        dacWrite(D_O,dac_value);
      #endif

      #ifdef Using_analog_output_ESP32_S3
        if(MCP_status)
        {
          int dac_value=(int)(joystickNormalizedToInt32*4096*0.9/10000);//limit the max to 5V*0.9=4.5V to prevent the overvolatage
          dac.setVoltage(dac_value, false);
        }
      #endif

      
      
      if ( fabs(dap_calculationVariables_st.Force_Range) > 0.01f)
      {
          normalizedPedalReading_fl32 = constrain((filteredReading - dap_calculationVariables_st.Force_Min) / dap_calculationVariables_st.Force_Range, 0.0f, 1.0f);
      }
      
      // simulate ABS trigger 
      if(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Simulate_ABS_trigger==1)
      {
        ABS_trigger_value=dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Simulate_ABS_value;
        if( (normalizedPedalReading_fl32*100.0f) > ABS_trigger_value)
        {
          absOscillation.trigger();
        }
      }

      // end profiler 6, ...
      profiler_pedalUpdateTask.end(6);

      // start profiler 8, struct exchange
      profiler_pedalUpdateTask.start(7);
      

  
      
      // update pedal states
      // check if data needs to be send
      if ( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
      {
        // send data every frame
        sendPedalStructsViaSerialCounter_u8 = 0;
        sendBasicFlag_b = true;
        sendExtendedFlag_b = true;
      }
      else
      {
        // send data every N-th frame
        sendPedalStructsViaSerialCounter_u8++;
        sendPedalStructsViaSerialCounter_u8 %= serialSendCounterMax_u8;
        sendBasicFlag_b = true;
        sendExtendedFlag_b = false;
      }

      if (pedalStateQueue != NULL) {


        if (sendBasicFlag_b)
        {
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalForce_u16 =  normalizedPedalReading_fl32 * 65535.0f;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalPosition_u16 = constrain(stepperPosFraction_fl32, 0.0f, 1.0f) * 65535.0f;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.joystickOutput_u16 = joystickNormalizedToUInt16;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalFirmwareVersion_u8[0] = versionMajor;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalFirmwareVersion_u8[1] = versionMinor;  
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalFirmwareVersion_u8[2] = versionPatch;
          //error code
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.error_code_u8 = 0;
          //pedal status update
          if(dap_calculationVariables_st.Rudder_status)
          {
            if(dap_calculationVariables_st.rudder_brake_status) dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalStatus=PEDAL_STATUS_RUDDERBRAKE;
            else dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalStatus=PEDAL_STATUS_RUDDER;
          }
          else dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalStatus=PEDAL_STATUS_NORMAL;
          //servo status update
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.servoStatus=stepper->servoStatus;

          #ifdef ESPNOW_Enable
            if(ESPNow_error_code!=0)
            {
              dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.error_code_u8=ESPNow_error_code;
              ESPNow_error_code=0;
            }
          #endif

          if( (stepper->getLifelineSignal()==false) && (stepper->servoStatus!=SERVO_IDLE_NOT_CONNECTED) )
          {
            dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.error_code_u8=12;
          }
          
          //fill the header
          dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
          dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;

          dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.payloadType = DAP_PAYLOAD_TYPE_STATE_BASIC;
          dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.version = DAP_VERSION_CONFIG;
          dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.PedalTag = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.pedal_type;        
          
