tcfshcrw/playground/ESP32/src/Main.cpp
                        configDataPackage_t configPackage_st;
                        configPackage_st.config_st = received_config;
                        xQueueSend(configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);
                        
                        if (received_config.payLoadHeader_.storeToEeprom == 1) {
                          Buzzer.single_beep_tone(700, 100);
                        }
                      }
                      break;
                  }
                  case DAP_PAYLOAD_TYPE_ACTION: {
                      DAP_actions_st received_action;
                      memcpy(&received_action, packet_start, sizeof(DAP_actions_st));

                      // ActiveSerial->println("Action received");

                      calculated_crc = checksumCalculator((uint8_t*)(&(received_action.payLoadHeader_)), sizeof(received_action.payLoadHeader_) + sizeof(received_action.payloadPedalAction_));
                      received_crc = received_action.payloadFooter_.checkSum;

                      if (calculated_crc != received_crc || received_action.payLoadHeader_.version != DAP_VERSION_CONFIG) {
                          structIsValid = false;
                      } else {
                          // --- VALID ACTION PACKET ---
                          // Place your extensive action handling logic here
                          // For clarity, this could be moved to its own function: handleActionPacket(received_action);
                          if (received_action.payloadPedalAction_.system_action_u8 == 2) {
                              ActiveSerial->println("ESP restart by user request");
                              ESP.restart();
                          }

                          //3= Wifi OTA
                          #ifdef ESPNOW_Enable
                          if (received_action.payloadPedalAction_.system_action_u8==(uint8_t)PedalSystemAction::ENABLE_OTA)
                          {
                            ActiveSerial->println("Get OTA command");
                            OTA_enable_b=true;
                            //OTA_enable_start=true;
                            ESPNow_OTA_enable=false;
                          }
                          #endif
                          //4 Enable pairing
                          if (received_action.payloadPedalAction_.system_action_u8==4)
                          {
                            #ifdef ESPNow_Pairing_function
                              ActiveSerial->println("Get Pairing command");
                              software_pairing_action_b=true;
                            #endif
                            #ifndef ESPNow_Pairing_function
                              ActiveSerial->println("no supporting command");
                            #endif
                          }
                          
                          if (received_action.payloadPedalAction_.system_action_u8==(uint8_t)PedalSystemAction::ESP_BOOT_INTO_DOWNLOAD_MODE)
                          {
                            #ifdef ESPNow_S3
                              ActiveSerial->println("Restart into Download mode");
                              delay(1000);
                              REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
                              ESP.restart();
                            #else
                              ActiveSerial->println("Command not supported");
                              delay(1000);
                            #endif
                            //ESPNOW_BootIntoDownloadMode = false;
                          }
                          if (received_action.payloadPedalAction_.system_action_u8 == (uint8_t)PedalSystemAction::PRINT_PEDAL_INFO)
                          {
                            char logString[200];
                            snprintf(logString, sizeof(logString),
                                    "Pedal ID: %d\nBoard: %s\nLoadcell shift= %.3f kg\nLoadcell variance= %.3f kg\nPSU voltage:%.1f V\nMax endstop:%lu\nCurrentPos:%lu\n\0",
                                    sct_dap_config_st.payLoadPedalConfig_.pedal_type, CONTROL_BOARD, loadcell->getShiftingEstimate(), loadcell->getSTDEstimate(), ((float)stepper->getServosVoltage() / 10.0f), dap_calculationVariables_st.stepperPosMaxEndstop, dap_calculationVariables_st.current_pedal_position);
                            ActiveSerial->println(logString);
                          }

                          // trigger ABS effect
                          if (received_action.payloadPedalAction_.triggerAbs_u8>0)
                          {
                            // ActiveSerial->println("Trigger ABS");
                            absOscillation.trigger();
                            if(received_action.payloadPedalAction_.triggerAbs_u8>1)
                            {
                              dap_calculationVariables_st.TrackCondition=received_action.payloadPedalAction_.triggerAbs_u8-1;
                            }
                            else
                            {
                              dap_calculationVariables_st.TrackCondition=received_action.payloadPedalAction_.triggerAbs_u8=0;
                            }
                          }
                          //RPM effect
                          _RPMOscillation.RPM_value=received_action.payloadPedalAction_.RPM_u8;
                          //G force effect
                          _G_force_effect.G_value=received_action.payloadPedalAction_.G_value-128;       
                          //wheel slip
                          if (received_action.payloadPedalAction_.WS_u8)
                          {
                            _WSOscillation.trigger();
                          }     
                          //Road impact
                          if(dap_calculationVariables_st.Rudder_status==false)
                          {
                            _Road_impact_effect.Road_Impact_value=received_action.payloadPedalAction_.impact_value_u8;
                          }
                          else
                          {

