tcfshcrw/playground/ESP32/src/Main.cpp
  // This task now waits for a complete package of data from the queue.
  PedalStatePackage_t receivedState;

  for(;;){

    // global_dap_config_class.getConfig(&sct_dap_config_st, 0);

    // Block indefinitely until a new state package arrives from pedalUpdateTask.
    // This is now the ONLY trigger for this task.
    if (xQueueReceive(pedalStateQueue, &receivedState, portMAX_DELAY) == pdPASS) {
      
      // Now, process the first item, and then enter a loop to
      // empty the rest of the queue.
      do {
                
        // Copy to a local variable to calculate CRC
        DAP_state_basic_st basic_to_send = receivedState.basic_st;
        DAP_state_extended_st extended_to_send = receivedState.extended_st;



  // Provide pedal states to ESPnow task
  #ifdef ESPNOW_Enable
        // update pedal states
        if(semaphore_updatePedalStates!=NULL)
        {
          if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)0)==pdTRUE) 
          {
            // move local structure values to global structures
            dap_state_basic_st = basic_to_send;
            dap_state_extended_st = extended_to_send;

            // release semaphore
            xSemaphoreGive(semaphore_updatePedalStates);
          }
        }
        else
        {
          semaphore_updatePedalStates = xSemaphoreCreateMutex();
        }
  #endif



        // activate profiler depending on pedal config
        // if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        // {
        //   profiler_serialCommunicationTask.activate( true );
        // }
        // else
        // {
        //   profiler_serialCommunicationTask.activate( false );
        // }
        // // start profiler 0, overall function
        // profiler_serialCommunicationTask.start(0);

        // send basic pedal state struct
        if (receivedState.sendBasicFlag_b)
        {
          // update CRC before transmission
          basic_to_send.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(basic_to_send.payLoadHeader_)), sizeof(basic_to_send.payLoadHeader_) + sizeof(basic_to_send.payloadPedalState_Basic_));
          ActiveSerial->write((char*)&basic_to_send, sizeof(DAP_state_basic_st));
        }

        // send extended pedal state struct
        if (receivedState.sendExtendedFlag_b)
        {
          // update CRC before transmission
          extended_to_send.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(extended_to_send.payLoadHeader_)), sizeof(extended_to_send.payLoadHeader_) + sizeof(extended_to_send.payloadPedalState_Extended_));
          ActiveSerial->write((char*)&extended_to_send, sizeof(DAP_state_extended_st));
        }

        // profiler_serialCommunicationTask.end(0);

        // // print profiler results
        // profiler_serialCommunicationTask.report();
      // Continue looping with a zero timeout to process any other items that are
      // already in the queue. The loop will exit when the queue is empty.
      } while (xQueueReceive(pedalStateQueue, &receivedState, (TickType_t)0) == pdPASS);


      // force a context switch
      // taskYIELD();
    }
  }
}

//OTA multitask

void otaUpdateTask( void * pvParameters )
{
  uint16_t OTA_count=0;
  unsigned long ota_debug_messaage_last=0;
  bool message_out_b=false;
  int OTA_update_status=99;

  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

      if(OTA_count>200)
      {
        message_out_b=true;
        OTA_count=0;
      }
      else
      {
        OTA_count++;
      }

      #if defined(OTA_update)  || defined(OTA_update_ESP32)
      if(OTA_enable_b)
      {
        if(message_out_b)
        {
          message_out_b=false;
          Serial1.println("OTA enable flag on");
        }
        if(OTA_status)
        {
          #ifdef OTA_update_ESP32
            server.handleClient();
          #endif
          #ifdef OTA_update
            if(OTA_update_status==0)
            {
              Buzzer.play_melody_tone(melody_victory_theme, sizeof(melody_victory_theme)/sizeof(melody_victory_theme[0]),melody_durations_Victory_theme);              
              ESP.restart();
            }
            else
            {
              if(dap_action_ota_st.payloadOtaInfo_.ota_action==OTA_ACTION_PLATFORMIO_DIRECT_UPLOAD)
              {
                //updload ota from platformio
                //sendESPNOWLog("Upload from platformIO");
                ArduinoOTA.handle(); 
                if(millis()-ota_debug_messaage_last>1000)
                {
                  ActiveSerial->println("Wait for ota update...");
                }
                
              }
              else
              {
                //show ota error
                Buzzer.single_beep_tone(770,100);
                #ifdef USING_LED
                  pixels.setPixelColor(0,0xff,0x00,0x00);//red
                  pixels.show(); 
                  delay(500);
                  pixels.setPixelColor(0,0x00,0x00,0x00);//no color
                  pixels.show();
                  delay(500);    
                #endif 
              }

            }

          #endif
          

        }
        else
        {
          esp_err_t result;
          ActiveSerial->println("de-initialize espnow");
          ActiveSerial->println("wait...");
          #ifdef ESPNOW_Enable
            sendESPNOWLog("OTA enabled, de-initialize espnow");
            sendESPNOWLog("wait...");
            delay(1000);
            result= esp_now_deinit();
            ESPNow_initial_status=false;
            ESPNOW_status=false;
          #else
            result = ESP_OK;
          #endif
          //result = ESP_OK;
          delay(3000);
          if(result==ESP_OK)
          {
            OTA_status=true;
            Buzzer.single_beep_tone(700,100); 
            delay(1000);
            #ifdef OTA_update_ESP32
            ota_wifi_initialize(APhost);
            #endif
            #ifdef USING_LED
                //pixels.setBrightness(20);
                pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
                pixels.show(); 
                //delay(3000);
            #endif
            #ifdef OTA_update
            wifi_initialized(SSID,PASS);
            delay(2000);
            //sendESPNOWLog("Wifi Connected");
            if(dap_action_ota_st.payloadOtaInfo_.ota_action!=OTA_ACTION_PLATFORMIO_DIRECT_UPLOAD)
            {
              ESP32OTAPull ota;
              int ret;
              ota.SetCallback(OTAcallback);
              ota.OverrideBoard(CONTROL_BOARD);
              char* version_tag;
              if(dap_action_ota_st.payloadOtaInfo_.ota_action==OTA_ACTION_FORCE_UPDATE)
              {
                const char* str;
                if(PCB_VERSION==3||PCB_VERSION==5||PCB_VERSION==9) str ="0.90.16";// for those board which change the partition table
                else str ="0.0.0";
                version_tag=new char[strlen(str) + 1];
                strcpy(version_tag, str);
                ActiveSerial->println("Force update");
              }
              if(dap_action_ota_st.payloadOtaInfo_.ota_action==OTA_ACTION_NORMAL)
              {
                version_tag=new char[strlen(DAP_FIRMWARE_VERSION) + 1];
                strcpy(version_tag, DAP_FIRMWARE_VERSION);
                //version_tag=DAP_FIRMWARE_VERSION;
              }
              switch (dap_action_ota_st.payloadOtaInfo_.mode_select)
              {
                case 1:
                  ActiveSerial->printf("Flashing to latest release, checking %s to see if an update is available...\n", OTA_JSON_URL_MAIN);
                  ret = ota.CheckForOTAUpdate(OTA_JSON_URL_MAIN, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                  ActiveSerial->printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  OTA_update_status=ret;
                  break;
                case 2:
                  ActiveSerial->printf("Flashing to latest dev build, checking %s to see if an update is available...\n", OTA_JSON_URL_DEV);
                  ret = ota.CheckForOTAUpdate(OTA_JSON_URL_DEV, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                  ActiveSerial->printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  OTA_update_status=ret;
                  break;
                case 3:
                  ActiveSerial->printf("Flashing to test build, checking %s to see if an update is available...\n", OTA_JSON_URL_TEST);
                  ret = ota.CheckForOTAUpdate(OTA_JSON_URL_TEST, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                  ActiveSerial->printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  OTA_update_status=ret;
                  break;
                default:
                break;
                delete[] version_tag; 
              }
            }  
            else
            {
              // initialize ota for platformIO upload
              ActiveSerial->println("OTA from platformIO");
              ota_arduinoota_initialize();
            }         
            #endif
            delay(3000);
          }

