tcfshcrw/playground/ESP32/src/Main.cpp
                  for(int i=0; i<4;i++)
                  {
                    if(_ESP_pairing_reg.Pair_status[i]==1)
                    {
                      if(i==0)
                      {
                        ESPNow.remove_peer(Clu_mac);
                        memcpy(&Clu_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(Clu_mac);
                        
                      }
                      if(i==1)
                      {
                        ESPNow.remove_peer(Brk_mac);
                        memcpy(&Brk_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(Brk_mac);
                      }
                      if(i==2)
                      {
                        ESPNow.remove_peer(Gas_mac);
                        memcpy(&Gas_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(Gas_mac);
                      }        
                      if(i==3)
                      {
                        ESPNow.remove_peer(esp_Host);
                        memcpy(&esp_Host,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(esp_Host);                
                      }        
                      if(espnow_dap_config_st.payLoadPedalConfig_.pedal_type==1)
                      {
                        Recv_mac=Gas_mac;
                      }
                      if(espnow_dap_config_st.payLoadPedalConfig_.pedal_type==2)
                      {
                        Recv_mac=Brk_mac;
                      }
                    }
                  }
                }
              }
            }
          #endif

          profiler_espNow.start(1);

          //joystick value broadcast
          /*
          if((joystickPacketsUpdateLast-millis())>joystickPacketInterval) 
          {
            ESPNow_Joystick_Broadcast(joystickNormalizedToInt32);
            joystickPacketsUpdateLast=millis();
          }
          */
          
          profiler_espNow.end(1);

          profiler_espNow.start(2);
          // assignment request packet send out
          if(assignmentUpdatePacketSend_b && noAssignmentStatus)
          {
            //ActiveSerial->println("Send out assignment request");
            assignmentUpdatePacketSend_b=false;
            DAP_AssignmentBoardcast_st dap_assignmentBoardcast_st;
            dap_assignmentBoardcast_st.payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
            dap_assignmentBoardcast_st.payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
            dap_assignmentBoardcast_st.payLoadHeader_.version = DAP_VERSION_CONFIG;
            dap_assignmentBoardcast_st.payLoadHeader_.payloadType = DAP_PAYLOAD_TYPE_ASSIGNMENT;
            dap_assignmentBoardcast_st.payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
            dap_assignmentBoardcast_st.payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;
            dap_assignmentBoardcast_st.payloadAssignmentRequest_.assignmentAction=1;
            memcpy(dap_assignmentBoardcast_st.payloadAssignmentRequest_.macAddress,esp_Mac,6);
            uint16_t crc = 0;
            crc = checksumCalculator((uint8_t *)(&(dap_assignmentBoardcast_st.payLoadHeader_)), sizeof(dap_assignmentBoardcast_st.payLoadHeader_) + sizeof(dap_assignmentBoardcast_st.payloadAssignmentRequest_));
            dap_assignmentBoardcast_st.payloadFooter_.checkSum=crc;
            ESPNow.send_message(broadcast_mac, (uint8_t *)&dap_assignmentBoardcast_st, sizeof(DAP_AssignmentBoardcast_st));
          }
          // basic state packet send out  
          if(basic_state_send_b && !noAssignmentStatus)
          {
            // update pedal states
            DAP_state_basic_st dap_state_basic_st_lcl;       
            // initialize with zeros in case semaphore couldn't be aquired
            memset(&dap_state_basic_st_lcl, 0, sizeof(dap_state_basic_st_lcl));
            if(semaphore_updatePedalStates!=NULL)
            {  
              if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
              {
                // UPDATE basic pedal state struct
                dap_state_basic_st_lcl = dap_state_basic_st;

                // release semaphore
                xSemaphoreGive(semaphore_updatePedalStates);
                dap_state_basic_st_lcl.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_basic_st_lcl.payLoadHeader_)), sizeof(dap_state_basic_st_lcl.payLoadHeader_) + sizeof(dap_state_basic_st_lcl.payloadPedalState_Basic_));
              }
            }
            else
            {
              semaphore_updatePedalStates = xSemaphoreCreateMutex();
            }
            ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_state_basic_st_lcl,sizeof(dap_state_basic_st_lcl));
            basic_state_send_b=false;
          }

          profiler_espNow.end(2);

          profiler_espNow.start(3);

          if (extend_state_send_b && !noAssignmentStatus)
          {
            // update pedal states
            DAP_state_extended_st dap_state_extended_st_espNow; 
            // initialize with zeros in case semaphore couldn't be aquired
            memset(&dap_state_extended_st_espNow, 0, sizeof(dap_state_extended_st_espNow));
            if(semaphore_updatePedalStates!=NULL)
            {  
              if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
              {
                // UPDATE extended pedal state struct
                dap_state_extended_st_espNow = dap_state_extended_st; 
                // release semaphore
                xSemaphoreGive(semaphore_updatePedalStates);
                dap_state_extended_st_espNow.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_extended_st_espNow.payLoadHeader_)), sizeof(dap_state_extended_st_espNow.payLoadHeader_) + sizeof(dap_state_extended_st_espNow.payloadPedalState_Extended_));
              }
            }
            else
            {
              semaphore_updatePedalStates = xSemaphoreCreateMutex();
            }

            ESPNow.send_message(broadcast_mac,(uint8_t *)&dap_state_extended_st_espNow, sizeof(dap_state_extended_st_espNow));
            extend_state_send_b=false;
          }

          profiler_espNow.end(3);

