tcfshcrw/playground/ESP32/src/Main.cpp
          if (ESPNow_config_request && !noAssignmentStatus)
          {
            DAP_config_st * dap_config_st_local_ptr;
            dap_config_st_local_ptr = &espnow_dap_config_st;
            dap_config_st_local_ptr->payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
            dap_config_st_local_ptr->payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
            dap_config_st_local_ptr->payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
            dap_config_st_local_ptr->payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;
            dap_config_st_local_ptr->payLoadHeader_.PedalTag = dap_config_st_local_ptr->payLoadPedalConfig_.pedal_type;
            uint16_t crc=0;
            crc = checksumCalculator((uint8_t*)(&(espnow_dap_config_st.payLoadHeader_)), sizeof(espnow_dap_config_st.payLoadHeader_) + sizeof(espnow_dap_config_st.payLoadPedalConfig_));
            dap_config_st_local_ptr->payloadFooter_.checkSum = crc;
            ESPNow.send_message(broadcast_mac,(uint8_t *) & espnow_dap_config_st, sizeof(espnow_dap_config_st));
            ESPNow_config_request=false;
            sendESPNOWLog("Pedal:%d Config returned by user request, CRC:%d", espnow_dap_config_st.payLoadPedalConfig_.pedal_type, crc);
            delay(2);
          }

          if (ESPNow_OTA_enable && !noAssignmentStatus)
          {
            ActiveSerial->println("Get OTA command");
            
            OTA_enable_b=true;
            OTA_enable_start=true;
            ESPNow_OTA_enable=false;
          }

          if (OTA_update_action_b && !noAssignmentStatus)
          {
            ActiveSerial->println("Starting Pedal OTA");
            buzzerBeepAction_b=true;
            OTA_enable_b=true;
            OTA_enable_start=true;
            ESPNow_OTA_enable=false;
            OTA_update_action_b = false;
            //ActiveSerial->println("get basic wifi info");
            //ActiveSerial->readBytes((char*)&dap_action_ota_st, sizeof(DAP_action_ota_st));
            #ifdef OTA_update

              if(dap_action_ota_st.payLoadHeader_.payloadType==DAP_PAYLOAD_TYPE_ACTION_OTA)
              {
                if(dap_action_ota_st.payloadOtaInfo_.device_ID == espnow_dap_config_st.payLoadPedalConfig_.pedal_type)
                {
                  SSID=new char[dap_action_ota_st.payloadOtaInfo_.SSID_Length+1];
                  PASS=new char[dap_action_ota_st.payloadOtaInfo_.PASS_Length+1];
                  memcpy(SSID,dap_action_ota_st.payloadOtaInfo_.WIFI_SSID,dap_action_ota_st.payloadOtaInfo_.SSID_Length);
                  memcpy(PASS,dap_action_ota_st.payloadOtaInfo_.WIFI_PASS,dap_action_ota_st.payloadOtaInfo_.PASS_Length);
                  SSID[dap_action_ota_st.payloadOtaInfo_.SSID_Length]=0;
                  PASS[dap_action_ota_st.payloadOtaInfo_.PASS_Length]=0;
                  OTA_enable_b=true;
                }
              }

            #endif

          }

          if (printPedalInfo_b && !noAssignmentStatus)
          {
            printPedalInfo_b=false;
            buzzerBeepAction_b=true;
            delay(100);
            pedalInfoBuilder.BuildInfoString(espnow_dap_config_st.payLoadPedalConfig_.pedal_type, CONTROL_BOARD, loadcell->getShiftingEstimate(), loadcell->getSTDEstimate(), ((float)stepper->getServosVoltage()/10.0f),dap_calculationVariables_st.stepperPosMaxEndstop,dap_calculationVariables_st.current_pedal_position);
            sendESPNOWLog(pedalInfoBuilder.logString);
            ActiveSerial->println(pedalInfoBuilder.logString);
            delay(3);
            pedalInfoBuilder.BuildESPNOWInfo(espnow_dap_config_st.payLoadPedalConfig_.pedal_type,rssi);
            sendESPNOWLog(pedalInfoBuilder.logESPNOWString);
            ActiveSerial->println(pedalInfoBuilder.logESPNOWString);

          }
          if (Get_Rudder_action_b && !noAssignmentStatus)
          {
            Get_Rudder_action_b=false;
            Buzzer.single_beep_tone(700,100);
          }
          if (Get_HeliRudder_action_b && !noAssignmentStatus)
          {
            Get_HeliRudder_action_b=false;
            Buzzer.single_beep_tone(700,100);
          }
          if (ESPNOW_BootIntoDownloadMode && !noAssignmentStatus)
          {
            #ifdef ESPNow_S3
              ActiveSerial->println("Restart into Download mode");
              sendESPNOWLog("Pedal:%d restart into Download mode", espnow_dap_config_st.payLoadPedalConfig_.pedal_type);
              delay(1000);
              REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
              ESP.restart();
            #else
              ActiveSerial->println("Command not supported");
              delay(1000);
            #endif
            ESPNOW_BootIntoDownloadMode = false;
          }
          //send out rudder packet after rudder initialized
          if (rudderPacketsUpdateLast - millis() > rudderPacketInterval && !noAssignmentStatus)
          {
            if((dap_calculationVariables_st.Rudder_status || dap_calculationVariables_st.helicopterRudderStatus) && (!Rudder_initializing && !HeliRudder_initializing))
            {              
              dap_rudder_sending.payloadRudderState_.pedal_position_ratio=dap_calculationVariables_st.current_pedal_position_ratio;
              dap_rudder_sending.payloadRudderState_.pedal_position=dap_calculationVariables_st.current_pedal_position;
              dap_rudder_sending.payLoadHeader_.payloadType=DAP_PAYLOAD_TYPE_ESPNOW_RUDDER;
              dap_rudder_sending.payLoadHeader_.PedalTag = espnow_dap_config_st.payLoadPedalConfig_.pedal_type;
              dap_rudder_sending.payLoadHeader_.version=DAP_VERSION_CONFIG;
              uint16_t crc=0;
              crc = checksumCalculator((uint8_t*)(&(dap_rudder_sending.payLoadHeader_)), sizeof(dap_rudder_sending.payLoadHeader_) + sizeof(dap_rudder_sending.payloadRudderState_));
              dap_rudder_sending.payloadFooter_.checkSum=crc;
              ESPNow.send_message(broadcast_mac,(uint8_t *) &dap_rudder_sending,sizeof(dap_rudder_sending));   
              //ESPNow_send=dap_calculationVariables_st.current_pedal_position; 
              //esp_err_t result =ESPNow.send_message(Recv_mac,(uint8_t *) &_ESPNow_Send,sizeof(_ESPNow_Send));                
              //if (result == ESP_OK) 
              //{
              //  ActiveSerial->println("Error sending the data");
              //}
              if (ESPNow_Rudder_Update && !noAssignmentStatus)
              {
                //dap_calculationVariables_st.sync_pedal_position=ESPNow_recieve;
                dap_calculationVariables_st.sync_pedal_position=dap_rudder_receiving.payloadRudderState_.pedal_position;
                dap_calculationVariables_st.Sync_pedal_position_ratio=dap_rudder_receiving.payloadRudderState_.pedal_position_ratio;
                ESPNow_Rudder_Update=false;
              }                
            }
            rudderPacketsUpdateLast=millis();
          }    
        }

        #ifdef ESPNow_debug_rudder
          if(print_count>1000)
          {
            if(dap_calculationVariables_st.Rudder_status)
            {
              ActiveSerial->print("Pedal:");
              ActiveSerial->print(espnow_dap_config_st.payLoadPedalConfig_.pedal_type);
              ActiveSerial->print(", Send %: ");
              ActiveSerial->print(dap_rudder_sending.payloadRudderState_.pedal_position_ratio);
              ActiveSerial->print(", Recieve %:");
              ActiveSerial->print(dap_rudder_receiving.payloadRudderState_.pedal_position_ratio);
              ActiveSerial->print(", Send Position: ");
              ActiveSerial->print(dap_calculationVariables_st.current_pedal_position);
              ActiveSerial->print(", % in cal: ");
              ActiveSerial->print(dap_calculationVariables_st.current_pedal_position_ratio); 
              ActiveSerial->print(", min cal: ");
              ActiveSerial->print(dap_calculationVariables_st.stepperPosMin_default); 
              ActiveSerial->print(", max cal: ");
              ActiveSerial->print(dap_calculationVariables_st.stepperPosMax_default);
              ActiveSerial->print(", range in cal: ");
              ActiveSerial->println(dap_calculationVariables_st.stepperPosRange_default); 
            }

