tcfshcrw/playground/ESP32/src/Main.cpp
            //Debug_rudder_last=now_rudder;
            //ActiveSerial->println(dap_calculationVariables_st.current_pedal_position);                  
                
            print_count=0;
          }
          else
          {
            print_count++;
                
          } 
              
                  
        #endif



      }

      profiler_espNow.end(0);

      // print profiler results
      profiler_espNow.report();

      // force a context switch
		taskYIELD();
    }
}
#endif


void miscTask( void * pvParameters )
{
  static DAP_config_st misc_dap_config_st;
  // for the task no need complete asap, ex buzzer, led 
  for(;;)
  {
    global_dap_config_class.getConfig(&misc_dap_config_st, 500);
    
    #ifdef ESPNOW_Enable
      //software assignment
      if(assignmentUpdate_b)
      {
        assignmentUpdate_b = false;
        writeAssignmentToEeprom();
        delay(1000);
        //restart after aassignment
        ESP.restart();
      }
      if (assignmentClear_b)
      {
        assignmentClear_b = false;
        clearAssignmentToEeprom();
        delay(1000);
        // restart after aassignment
        ESP.restart();
      }
#endif
    // make buzzer sound actions here
    #ifdef ESPNOW_Enable
      if (Config_update_Buzzer_b)
      {
        Buzzer.single_beep_tone(700, 50);
        Config_update_Buzzer_b = false;
      }
      if (assignmentUpdateBuzzer_b)
      {
        ActiveSerial->println("Beep");
        Buzzer.single_beep_tone(700, 50);
        assignmentUpdateBuzzer_b = false;
      }
      if(buzzerBeepAction_b)
      {
        Buzzer.single_beep_tone(700,50);
        buzzerBeepAction_b=false;
      }
    #endif
    #if defined(OTA_update) && defined(USING_BUZZER)
      if(beepForOtaProgress)
      {
        Buzzer.single_beep_tone(700,50);
        beepForOtaProgress=false;
      }
    #endif
    delay(50);
  }
}
